# # Задание №1
# x = str(int(float(5))) # Тип str
#----------------------------------------
# # Задание №2
# x = 'aa' == 'AA' # Тип bool
#---------------------------------------
# # Задание №3
# x = {i: i**2 for i in range(5)} # Тип dict
#---------------------------------------
# # Задание №4
# x = set(list((5, 6, 7))) # Тип set
#---------------------------------------
# # Задание №5
# a = {1: 1, 2: 4, 3: 9}
# x = a.get(4) # Тип NoneType
#---------------------------------------
# # Задание №6
#x = [].append('j') # Тип NoneType
#--------------------------------------
# Задание №7
# for i in range(10):
#     if i < 5:
#         x = 'hello'
#     else:
#         x = 5 # Тип int
#-------------------------------------
# Задание №8
# x = input('Enter and integer: ') # Тип str
#-------------------------------------
# Задание №9
# a = 5
# b = [1, 3, 5, ]
# x = 'x'
# a, b, x = x, a, b # Тип list
#-------------------------------------
# Задание №10
# def func(x, y=5):
#     return x + y
# x = func('Jaguar ', 'hunter') # Тип str
# -----------------------------------


